#+TITLE: Paths Properties
#+NAME: Paths
#+AUTHOR: Johann Rosain

** Transport of refl

#+begin_src ctt
  tr/refl-path (A : U) (x : A) (P : A -> U) (u : P x) : Path (P x) (tr A x x (refl A x) P u) u =
    \ i. tr/refl A x P i u

  tr/refl-path' (A : U) (x : A) (P : A -> U) (u : P x) : Path (P x) u (tr A x x (refl A x) P u) =
    inv
      ( P x)
      ( tr A x x (refl A x) P u) u
      ( tr/refl-path A x P u)
#+end_src

It generalizes using J.
#+begin_src ctt
  tr/path (A : U) (x y : A) (p : Path A x y) (P : U) (u : P) : Path P (tr A x y p (\ _. P) u) u =
    J A x (\ z q. Path P (tr A x z q (\ _. P) u) u) (tr/refl-path A x (\ _. P) u) y p

  tr/inv-path (A : U) (x y : A) (p : Path A x y) (P : U) (u : P) : Path P u (tr A x y p (\ _. P) u) =
    inv P (tr A x y p (\ _. P) u) u (tr/path A x y p P u)
#+end_src

#+RESULTS:
: Typecheck has succeeded.
** inv is involutive

   #+begin_src ctt
  inv/involutive (A : U) (x y : A) (p : Path A x y) : Path (Path A x y) (inv A y x (inv A x y p)) p =
    J A x (\ z q. Path (Path A x z) (inv A z x (inv A x z q)) q)
          (comp (Path A x x) (inv A x x (inv A x x (refl A x))) (inv A x x (refl A x))
                (ap (Path A x x) (Path A x x) (\ q. inv A x x q) (inv A x x (refl A x)) (refl A x) (inv/refl A x))
                (refl A x) (inv/refl A x)) y p

  inv/involutive' (A : U) (x y : A) (p : Path A x y) : Path (Path A x y) p (inv A y x (inv A x y p)) =
    inv (Path A x y) (inv A y x (inv A x y p)) p (inv/involutive A x y p)
   #+end_src

#+RESULTS:
: Typecheck has succeeded.
** Squares
    #+begin_src ctt
  square (A : U) (x y1 y2 z : A) (p-left : Path A x y1) (p-bottom : Path A y1 z) (p-top : Path A x y2) (p-right : Path A y2 z) : U =
    Path (Path A x z)
      ( comp A x y1 p-left z p-bottom)
      ( comp A x y2 p-top z p-right)

  square-top (A : U) (x y1 y2 z : A) (p1 : Path A x y1) (q1 : Path A y1 z) (p2 : Path A x y2) (p2' : Path A x y2) (s : Path (Path A x y2) p2 p2') (q2 : Path A y2 z)
             (sq : square A x y1 y2 z p1 q1 p2 q2) : square A x y1 y2 z p1 q1 p2' q2 =
    J
      ( Path A x y2) p2
      ( \ p _. square A x y1 y2 z p1 q1 p q2) sq p2' s    
    #+end_src

#+RESULTS:
: Typecheck has succeeded.
** =ap f (H x)= and =G (f x)=
Let f : A \to B and g : B \to A such that G : f \circ g \sim id and H : g \circ f \sim id. Then there is a G' : g \circ f \sim id such that ap f (H x) = G' (f x).
#+begin_src ctt
  htpy/half-adjoint/htpy (A B : U) (f : A -> B) (g : B -> A) (G : Htpy' B B (\ y. f (g y)) (id B)) (H : Htpy' A A (\ x. g (f x)) (id A)) (y : B)
                              : Path B (f (g y)) y =
    comp B
      ( f (g y))
      ( f (g (f (g y))))
      ( inv B (f (g (f (g y)))) (f (g y)) (G (f (g y)))) y
      ( comp B
        ( f (g (f (g y))))
        ( f (g y))
        ( ap A B f (g (f (g y))) (g y) (H (g y))) y
        ( G y))

  htpy/half-adjoint (A B : U) (f : A -> B) (g : B -> A) (G : Htpy' B B (\ y. f (g y)) (id B)) (H : Htpy' A A (\ x. g (f x)) (id A)) (x : A)
                         : Path (Path B (f (g (f x))) (f x)) (ap A B f (g (f x)) x (H x)) (htpy/half-adjoint/htpy A B f g G H (f x)) =
    inv/concat B
      ( f (g (f (g (f x)))))
      ( f (g (f x)))
      ( G (f (g (f x))))
      ( f x)
      ( ap A B f (g (f x)) x (H x))
      ( comp B
        ( f (g (f (g (f x)))))
        ( f (g (f x)))
        ( ap A B f (g (f (g (f x)))) (g (f x)) (H (g (f x))))
        ( f x)
        ( G (f x)))
      ( square-top B
        ( f (g (f (g (f x)))))
        ( f (g (f x)))
        ( f (g (f x)))
        ( f x)
        ( G (f (g (f x))))     
        ( ap A B f (g (f x)) x (H x))
        ( ap A B (\ z. (f (g (f z)))) (g (f x)) x (H x))
        ( ap A B f (g (f (g (f x)))) (g (f x)) (H (g (f x))))
        ( comp 
          ( Path B (f (g (f (g (f x))))) (f (g (f x))))
          ( ap A B (\ z. (f (g (f z)))) (g (f x)) x (H x))
          ( ap A B f (g (f (g (f x)))) (g (f x)) (ap A A (\ z. g (f z)) (g (f x)) x (H x)))
          ( ap/comp' A A B
            ( \ z. g (f z)) f
            ( g (f x)) x
            ( H x))
          ( ap A B f (g (f (g (f x)))) (g (f x)) (H (g (f x))))
          ( ap
            ( Path A (g (f (g (f x)))) (g (f x)))
            ( Path B (f (g (f (g (f x))))) (f (g (f x))))
            ( ap A B f (g (f (g (f x)))) (g (f x)))
            ( ap A A (\ z. g (f z)) (g (f x)) x (H x))
            ( H (g (f x)))
            ( nat-htpy' A (\ z. g (f z)) H x)))
          ( G (f x))
          ( naturality A B (\ z. f (g (f z))) f (\ z. G (f z)) (g (f x)) x (H x)))

  htpy/half-adjoint' (A B : U) (f : A -> B) (g : B -> A) (G : Htpy' B B (\ y. f (g y)) (id B)) (H : Htpy' A A (\ x. g (f x)) (id A)) (x : A)
                          : Path (Path B (f (g (f x))) (f x)) (htpy/half-adjoint/htpy A B f g G H (f x)) (ap A B f (g (f x)) x (H x)) =
    inv 
      ( Path B (f (g (f x))) (f x))
      ( ap A B f (g (f x)) x (H x))
      ( htpy/half-adjoint/htpy A B f g G H (f x))
      ( htpy/half-adjoint A B f g G H x)
#+end_src

#+RESULTS:
: Typecheck has succeeded.
** Filling of dependent square of a set
Let a_0, a_1 : A and p, q : a_0 = a_1 such that \alpha : p = q. We have a full square with sides (refl a_0), (refl a_1), p, q. Assume now that B : A -> Set, and b_0 : B a_0, b_1 : B a_1 with p', q' : b_0 = b_1 (dependent paths). Then we can fill the square in B, that is, p' = q'.
#+begin_src ctt
  square/dependent-fill/refl (A : U) (B : A -> UU-Set) (x : A) (x' : A) (p : Path A x x') (y : Set/type (B x)) (y' : Set/type (B x'))
                             (p' q' : PathP (i. Set/type (B (p i))) y y') : Path (PathP (i. Set/type (B (p i))) y y') p' q' =
    J A x
      ( \ x0 q. (y0 : Set/type (B x)) -> (y1 : Set/type (B x0)) -> (p0 q0 : PathP (i. Set/type (B (q i))) y0 y1) -> Path (PathP (i. Set/type (B (q i))) y0 y1) p0 q0)
      ( Set/is-set (B x)) x' p y y' p' q'

  square/dependent-fill (A : U) (B : A -> UU-Set) (x x' : A) (p : Path A x x') : (q : Path A x x') -> (spq : Path (Path A x x') p q) ->
                        (y : Set/type (B x)) -> (y' : Set/type (B x')) -> (p' : PathP (i. Set/type (B (p i))) y y') -> (q' : PathP (i. Set/type (B (q i))) y y')
                        -> PathP (i. PathP (j. Set/type (B (spq i j))) y y') p' q' =
    J ( Path A x x') p
      ( \ q'' spq0. (y0 : Set/type (B x)) -> (y1 : Set/type (B x')) -> (p0 : PathP (i. Set/type (B (p i))) y0 y1) -> (q0 : PathP (i. Set/type (B (q'' i))) y0 y1)
                   -> PathP (i. PathP (j. Set/type (B (spq0 i j))) y0 y1) p0 q0)
      ( square/dependent-fill/refl A B x x' p)

#+end_src

#+RESULTS:
: Typecheck has succeeded.

